Openfoam-Xeon-host/OpenFOAM-2.3.1/tutorials/incompressible/pimpleDyMFoam/mixerVesselAMI2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

./makeMesh

#runApplication $application
runApplication decomposePar
runParallel $application 4
runApplication reconstructPar

# ----------------------------------------------------------------- end-of-file
